ujfj1986/msp430/inc/uart.c
/*
 * uart.c - implement the uart module.
 *
* Author: Shan Jiejing
* Date: 2016-11-3
*/

#include <msp430x14x.h>
#include "uart.h"

//#define NULL ((void *)0)

struct Uart gUart[2];

int initUart() {
  gUart[UART0].index = UART0;
  initBuffer(&(gUart[UART0].rBuffer));
  initBuffer(&(gUart[UART0].wBuffer));
  gUart[UART1].index = UART1;
  initBuffer(&(gUart[UART1].rBuffer));
  initBuffer(&(gUart[UART1].wBuffer));
  return 0;
}

int openUart(int num) {
  if (num != 0 && num != 1) return -1;
  if (num == 0) { 
    P3SEL |= 0x30;
    ME1 |= URXE0 + UTXE0;
    UCTL0 |= CHAR; 
    UTCTL0 |= SSEL0; 
    UBR00 = 0x03; 
    UBR10 = 0x00; 
    UMCTL0 = 0x4A; 
    UCTL0 &= ~SWRST;
    IE1 |= URXIE0;
  } else { 
    P3SEL |= 0xC0; 
    UCTL1 |= SWRST;
    UTCTL1 |= SSEL0; 
    UBR01 = 0x03; 
    UBR11 = 0x00; 
    UMCTL1 = 0x4A; 
    UCTL1 &= ~SWRST;
    ME2 |= URXE1 + UTXE1; 
    IE2 |= URXIE1;
  } 

  return 0;
}

#pragma vector = UART1RX_VECTOR
__interrupt void Uart1_Rx(void) {
  struct Buffer *pBuffer = &(gUart[UART1].rBuffer);
  unsigned char tmp = U1RXBUF;
  writeBuffer(pBuffer, tmp);
  LPM4_EXIT;
  //trigger uart1 rx event
}

extern volatile  uchar CpuStatus;
extern volatile uchar tmp;



/*
  #if 0
  while ((IFG1 & URXIFG0) == 0);

  struct Buffer *pBuffer = &(gUart[UART0].rBuffer);
  unsigned char tmp = U0RXBUF;
  writeBuffer(pBuffer, tmp);
#endif
  //LPM4_EXIT;
  //trigger uart0 rx event
}*/

int readFrom(int num, unsigned char* pVal, int size) {
  struct Buffer *pBuffer = NULL;
  if (num != 0 && num != 1) return -1;
  
  pBuffer = &(gUart[num].rBuffer);
  return readBuffer(pBuffer, pVal, size);
}

int writeByteTo(int num, unsigned char val) {
  if (num != 0 && num != 1) return -1;
  
  if (num == 0) {
    U0TXBUF = val;
  } else {
    U1TXBUF = val;
  }
  while((num == 0) ? ((IFG1 & UTXIFG0) == 0) : ((IFG2 & UTXIFG1) == 0));
  if (num == 0) {
    IFG1 &= ~UTXIFG0;
  } else {
    IFG2 &= ~UTXIFG1;
  }
  
  return 0;
}

int writeStrTo(int num, unsigned char* p, int len) {
  int i = 0;
  if (NULL == p || len <= 0) return -1;

  for (i = 0; p[i] != '\0'; i++)
    writeByteTo(num, p[i]);
  
  return i;
}


int closeUart(int num) {
  if (num != 0 && num != 1) return -1;
  
  if (num == 0) {
    P3SEL &= 0xCF;
    P3DIR |= 0x30;
  } else {
    P3SEL &= 0x3F;
    P3DIR |= 0xC0;
  }

  return 0;
}